Anyc-Qing/AUTOSAR/core/mcal/Adc/src/Adc_Hw_tms570.c
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/
/** @tagSettings DEFAULT_ARCHITECTURE=TMS570 */
/** @reqSettings DEFAULT_SPECIFICATION_REVISION=4.3.0 */

/** @file Adc_Hw_tms570.c
 *  This file contains the TMS570 hardware specific implementation of the API's.
 */
/** \addtogroup Mcal
  * @brief This is the major Mcal folder
  *
  *  This group is for the TMS570 Mcal
  *  @{
  */

 /** \addtogroup Adc
  *  This is the TMS570 Mcal Adc Group
  *  @{
  */

#include "Adc_Hw_tms570.h"
#include "irq_tms570.h"
#if defined(USE_DET)
#include "Det.h"
#endif
#if defined(USE_DEM) || defined (WDG_USE_DEM)
#include "Dem.h"
#endif
#include "SchM_Adc.h"
#include "isr.h"
#include "Adc_MemMap.h"
#include "Adc.h"
#include "Adc_Internal.h"
#include "Adc_Hw_Common.h"
#include "isr.h"
#include <string.h>


/* ----------------------------[Macro Definitions]--------------*/
/**
  * @name    Hardware specific macros
  * @{
  */
#define EV_THR_INT_FLG_MASK	(1uL<<0u)				/**< 0x00000001: ADGxINTFLG Register bit 0, group threshold interrupt flag*/
#define EV_END_MASK			(1uL<<3u)				/**< 0x00001000: ADGxINTFLG Register bit 3, group conversion end interrupt flag*/
#define GxBUF_DATA10_MASK 	0x3ffuL					/**< 0x000003ff: conversion result data mask,10 bits*/
#define GxBUF_DATA12_MASK 	0xfffuL					/**< 0x00000fff: conversion result data mask,12 bits*/
#define RSTCR_RELEASE		0x0uL					/**< 0x00000000: ADRSTCR Register bit 0, module is released from the reset state*/
#define GxSAMP_ACQ_MASK		0x3ffuL					/**< 0x000003ff: ADGxSAMP Register bit 0 to 11 mask*/
#define ADC_EN_10BIT		0x00140001uL			/**< 0x00140001: ADOPMODECR Register setting: 10-bit resolution, other bits are default*/
#define ADC_EN_12BIT		0x80140001uL			/**< 0x80140001: ADOPMODECR Register setting: 12-bit resolution, other bits are default*/
#define ADC_HW_CNTR_NUM		0x2uL					/**< 0x00000002: Total number of ADC hardware core module in TMS570*/

/** @} */

/* ----------------------------[Function Declaration]-----------*/
ISR( ADC1Grp1ConversionComplete_Isr);
ISR( ADC1Grp2ConversionComplete_Isr);
ISR( ADC2Grp1ConversionComplete_Isr);
ISR( ADC2Grp2ConversionComplete_Isr);


/* ----------------------------[Variable Definition]-----------*/
/**
 * @brief   adcState - Specifies the state of Adc module, either initialized or uninitialized.
 */
static volatile Adc_StateType adcState = ADC_STATE_UNINIT;

/**
 * @brief   Adc_Global - Represents the configuration set of the whole Adc module.
 */
static Adc_GlobalType Adc_Global;


/* ----------------------------[Static Function]-----------------*/

/**
 * @brief  get the register set base address of hardware controller
 * @param[in] _unit - hardware controller id, controller 0 or controller 1
 * @return adcBASE_t pointer
 * @retval pointer to register set base address
 */
static inline adcBASE_t* GET_HW_PTR(uint32 _unit){
	/*lint -e{923} MISRA:PERFORMANCE:cast from unsigned int to pointer:[MISRA 2012 Rule 11.1, required]*/
	adcBASE_t* BaseAddress[]={adcREG1,adcREG2};
	return BaseAddress[_unit];
}

/* ----------------------------[Supported Requirements]---------*/
/** @req SWS_Adc_00080 If for a notification call-back the NULL pointer is configured, no call-back shall be executed. */
/** @req SWS_Adc_00356 The ADC module shall support the start condition “Software API Call” for all conversion modes. The trigger source “Software API Call” means that the conversion of an ADC Channel group is started/stopped with a service provided by the ADC module*/
/** @req SWS_Adc_00279 The ADC module shall allow configuring exactly one trigger source for each ADC Channel group. */

/* ----------------------------[Not Supported Requirements]---------*/
/** !req SWS_Adc_00357 The ADC module shall support the start condition “Hardware Event” for groups configured in One-Shot conversion mode. */
/** !req SWS_Adc_00288 The ADC module shall allow the configuration of a priority level for each channel group. */
/** !req SWS_Adc_00310 The ADC module’s priority mechanism shall allow aborting and restarting of channel group conversions. */
/** !req SWS_Adc_00345 The ADC module’s priority mechanism shall allow suspending and resuming of channel group conversions. */
/** !req SWS_Adc_00430 The ADC module shall allow a group specific configuration whether the abort/restart or suspend/resume mechanism is used for interrupted channel groups. */
/** !req SWS_Adc_00311 The ADC module’s priority mechanism shall allow the queuing of requests for different groups. */
/** !req SWS_Adc_00312 In the ADC module’s priority mechanism the lowest priority is 0. */
/** !req SWS_Adc_00289 In the ADC module’s priority mechanism the lowest priority is 0. */
/** !req SWS_Adc_00315 The ADC module shall support the static configuration option to disable the priority mechanism. */
/** !req SWS_Adc_00340 The ADC module shall support the static configuration option to enable the priority mechanism ADC_PRIORITY_HW_SW. */
/** !req SWS_Adc_00341 If the priority mechanism is supported by the hardware: The ADC module shall support the static configuration option ADC_PRIORITY_HW */
/** !req SWS_Adc_00339 If hardware priority mechanism is supported and selected: The ADC module shall allow the mapping of the configured priority levels (0-255) to the available hardware priority levels. */
/** !req SWS_Adc_00332 If the priority mechanism is active, the ADC module shall support a queuing of conversion requests. */
/** !req SWS_Adc_00417 If the priority mechanism is active, the ADC module shall handle channel group conversion requests for groups with the same priority level, in a ‘first come first served’ order. */
/** !req SWS_Adc_00333 If the priority mechanism is not active and if the static configuration parameter AdcEnableQueuing is set to ON, the ADC module shall support a queuing of conversion requests and shall service the software groups in a ‘first come first served’ order.*/
/** !req SWS_Adc_00335 If the queuing mechanism is active (priority mechanism active or queuing explicitly activated), the ADC module shall store each software conversion request per channel group at most one time in the software queue.*/
/** !req SWS_Adc_00336 Enable hardware trigger requests’, generated with API function Adc_EnableHardwareTrigger, shall not be stored in any queue. */
/** !req SWS_Adc_00337 The hardware prioritization mechanism shall be used in case of hardware triggered conversion requests. */
/** !req SWS_Adc_00338 The ADC module shall not store additional software conversion requests for the same group, whose group status is not equal to ADC_IDLE. */
/** !req SWS_Adc_00445 The ADC module shall allow configuring limit checking for ADC Channels. */
/** !req SWS_Adc_00446 If limit checking is active for an ADC Channel, only ADC conversion results, which are in the configured range, are taken into account for updating the user specified ADC result buffer. */
/** !req SWS_Adc_00447 If limit checking is active for an ADC Channel, only ADC conversion results, which are in the configured range, are taken into account for triggering state transitions of the ADC group status. */
/** !req SWS_Adc_00448 If continuous conversion mode with SW trigger source is selected: if limit checking is active for an ADC Channel, ADC conversion results, which are not in the configured range, are neglected from the ADC driver, and the conversion is reiterated. */
/** !req SWS_Adc_00449 If one-shot conversion mode with SW trigger source is selected: if limit checking is active for an ADC Channel, an ADC conversion result, which is not in the configured range, is neglected from the ADC driver, and the ADC group, containing the ADC channel, will stay in state ADC_BUSY. */
/** !req SWS_Adc_00450 If one-shot conversion mode with HW trigger source is selected: if limit checking is active for an ADC Channel, ADC conversion results, which are not in the configured range, are neglected from the ADC driver, and the conversion is reissued, triggered by the next HW trigger. */

