Anyc-Qing/AUTOSAR/core/mcal/Adc/src/Adc_Hw_tms570.c
/** !req SWS_Adc_00462 The ADCDriver shall support power state changes and its APIs when the corresponding configuration parameter AdcLowPowerStatesSupport is set to TRUE. */
/** !req SWS_Adc_00463 If the parameter AdcLowPowerStatesSupport is enabled */
/** !req SWS_Adc_00464 The APIs Adc_GetTargetPowerState and Adc_GetCurrentPowerState shall be respectively used */
/** !req SWS_Adc_00465 The API Adc_PreparePowerState shall be used to start a power state transition. */
/** !req SWS_Adc_00466 After preparation for a power state is achieved by API Adc_PreparePowertState then the API Adc_SetPowerState shall be used to achieve the requested power state of the ADC module. */
/** !req SWS_Adc_00467 ADC Driver shall keep track of the call order of the APIs Adc_SetPowerState and Adc_PreparePowerState. */
/** !req SWS_Adc_00469 The Adc Module shall keep track of the current and of the target powerstate if the parameter AdcLowPowerStatesSupport is set to TRUE. */
/** !req SWS_Adc_00470 After the Initiliazation the power state of the module shall be always FULL POWER if the AdcLowPowerStatesSupport is set to TRUE. */
/** !req SWS_Adc_00471 The ADC Driver shall support synchronuous and asynchronous power state transitions */
/** !req SWS_Adc_00472 Related to configuration parameter AdcPowerStateAsynchTransitionMode */
/** !req SWS_Adc_00473 Related to parameter AdcPowerStateAsynchTransitionMode */

/** !req SWS_Adc_00511 Adc_SamplingTimeType */
/** !req SWS_Adc_00512 Adc_ResolutionType */
/** !req SWS_Adc_00521 Adc_HwTriggerTimerType */
/** !req SWS_Adc_00522 PriorityImplementationType */
/** !req SWS_Adc_00523 GroupReplacementType */
/** !req SWS_Adc_00524 ChannelRangeSelectType */
/** !req SWS_Adc_00525 ResultAlignmentType */
/** !req SWS_Adc_00526 Adc_PowerStateType */
/** !req SWS_Adc_00527 Adc_PowerStateRequestResultType */
/** !req SWS_Adc_00054 In case of Variant PB:The function Adc_Init shall initialize the ADC hardware units and driver according to the configuration set referenced by ConfigPtr. */
/** !req SWS_Adc_00437 When the ADC Channel Group is in one-shot and software-trigger mode, the function Adc_StopGroupConversion shall remove a start/restart request of the group from the queue */
/** !req SWS_Adc_00438 When the ADC Channel Group is in continuous-conversion and software-trigger mode, the function Adc_StopGroupConversion shall remove a start/restart request of the group from the queue */
/** !req SWS_Adc_00113 The function Adc_ReadGroup shall read the raw converted values without further scaling. The read values shall be aligned according the configuration parameter setting of ADC_RESULT_ALIGNMENT. */

/** !req SWS_Adc_00114 The function Adc_EnableHardwareTrigger shall enable the hardware trigger for the requested ADC Channel group. */
/** !req SWS_Adc_00144 A group with trigger source hardware, whose trigger was enabled with Adc_EnableHardwareTrigger, shall execute the group channel conversions, whenever a trigger event occurs. */
/** !req SWS_Adc_00432 The function Adc_EnableHardwareTrigger shall reset the internal group result buffer pointer */
/** !req SWS_Adc_00136 If development error detection for the ADC module is enabled: if the group is configured for software API trigger mode, the function Adc_EnableHardwareTrigger shall raise development error ADC_E_WRONG_TRIGG_SRC and return without any action. */
/** !req SWS_Adc_00281 If a HW group is erroneously configured for continuous conversion mode, the function Adc_EnableHardwareTrigger shall raise development error ADC_E_WRONG_CONV_MODE and return without any action. */
/** !req SWS_Adc_00429 The function Adc_DisableHardwareTrigger shall remove any queued start/restart request for the requested ADC Channel group if queuing is enabled. */
/** !req SWS_Adc_00145 The function Adc_DisableHardwareTrigger shall abort an ongoing conversion, if applicable (supported by the hardware). */
/** !req SWS_Adc_00129 If the channel group ID is non-existing, the function Adc_DisableHardwareTrigger shall raise development error ADC_E_PARAM_GROUP and return without any action. */
/** !req SWS_Adc_00137 If the group is configured for software API trigger mode, the function Adc_DisableHardwareTrigger shall raise development error ADC_E_WRONG_TRIGG_SRC and return without any action. */
/** !req SWS_Adc_00282 If a HW group is erroneously configured for continuous conversion mode, the function Adc_DisableHardwareTrigger shall raise development error ADC_E_WRONG_CONV_MODE and return without any action. */
/** !req SWS_Adc_00304 If the group is not enabled (with a previous call of Adc_EnableHardwareTrigger), the function Adc_DisableHardwareTrigger shall raise development error ADC_E_IDLE and return without any action. */
/** !req SWS_Adc_00298 If development error detection for the ADC module is enabled: if called prior to initializing the ADC module, Adc_DisableHardwareTrigger shall raise development error ADC_E_UNINIT and return without any action. */
/** !req SWS_Adc_00436 In case of an aborted/suspended group, the state of the queued group remains the same as it was before the group was aborted/suspended. */
/** !req SWS_Adc_00418 All values which the ADC driver stores in the ADC result buffer, are left without further scaling and shall be aligned according the configuration parameter setting of ADC_RESULT_ALIGNMENT. */

/** !req SWS_Adc_00475 Std_ReturnType Adc_SetPowerState( Adc_PowerStateRequestResultType* Result ) */
/** !req SWS_Adc_00481 The API configures the HW in order to enter the previously prepared Power State. */
/** !req SWS_Adc_00482 In case the target power state is the same as the current one, no action is executed and the API returns immediately with an E_OK result. */
/** !req SWS_Adc_00483 In case the normal Power State is requested, the API shall refer to the necessary parameters contained in the same containers used by Adc_Init. */
/** !req SWS_Adc_00484 For the other power states, only power state transition specific reconfigurations shall be executed in the context of this API (i.e. the API cannot be used to apply a completely new configuration to the Adc module). */
/** !req SWS_Adc_00485 The API shall refer to the configuration container related to the required Power State in order to derive some specific features of the state (e.g support of Power States). */
/** !req SWS_Adc_00486 In case development error reporting is activated: The API shall report the DET */
/** !req SWS_Adc_00487 The API shall report the DET error ADC_E_NOT_DISENGAGED in case this API is called when one or more HW channels (where applicable) are in a state different then IDLE (or similar non-operational states) and/or there are still notification registered for the HW module channels. */
/** !req SWS_Adc_00488 The API shall report the DET error ADC_E_POWER_STATE_NOT_SUPPORTED in case this API is called with an unsupported power state or the peripheral does not support low power states at all. */
/** !req SWS_Adc_00489 The API shall report the DET error ADC_E_TRANSITION_NOT POSSIBLE in case the requested power state cannot be directly reached from the current power state. */
/** !req SWS_Adc_00490 The API shall report the DET error ADC_E_PERIPHERAL_NOT_PREPARED in case the HW unit has not been previously prepared for the target power state by use of the API Adc_PreparePowerState(). */

/** !req SWS_Adc_00476 Std_ReturnType Adc_GetCurrentPowerState( Adc_PowerStateType* CurrentPowerState, Adc_PowerStateRequestResultType* Result ) */
/** !req SWS_Adc_00491 The API shall report the DET error ADC_E_UNINIT in case this API is called before having initialized the HW unit.*/

/** !req SWS_Adc_00477 Std_ReturnType Adc_GetTargetPowerState( Adc_PowerStateType* TargetPowerState, Adc_PowerStateRequestResultType* Result ) */
/** !req SWS_Adc_00492 This shall coincide with the current power state if no transition is ongoing. The API is considered to always succeed except in case of HW failures. */
/** !req SWS_Adc_00493 The API shall report the DET error ADC_E_UNINIT in case this API is called before having initialized the HW unit. */

/** !req SWS_Adc_00478 Std_ReturnType Adc_PreparePowerState( Adc_PowerStateType PowerState, Adc_PowerStateRequestResultType* Result ) */
/** !req SWS_Adc_00494 This API initiates all actions needed to enable a HW module to enter the target power state. */
/** !req SWS_Adc_00495 In case the target power state is the same as the current one, no action is executed and the API returns immediately with an E_OK result. */
/** !req SWS_Adc_00496 The API shall report the DET error ADC_E_UNINIT in case this API is called before having initialized the HW unit. */
/** !req SWS_Adc_00497 The API shall report the DET error ADC_E_POWER_MODE_NOT_SUPPORTED in case this API is called with an unsupported power state is requested or the peripheral does not support low power states at all. */
/** !req SWS_Adc_00498 The API shall report the DET error ADC_E_TRANSITION_NOT POSSIBLE in case the requested power state cannot be directly reached from the current power state. */

/** !req SWS_Adc_00479 void Adc_Main_PowerTransitionManager( void ) */
/** !req SWS_Adc_00499 This API executes any non-immediate action needed to finalize a power state transition requested by Adc_PreparePowerState(). */
/** !req SWS_Adc_00500 The rate of scheduling shall be defined by Adc MainSchedulePeriod and shall be variable, as the function only needs to be called if a transition has been requested */
/** !req SWS_Adc_00501 This API shall also issue callback notifications to the eventually registered users (IoHwAbs) as configured, only in case the asynch mode is chosen. */
/** !req SWS_Adc_00502 In case the ADC module is not initialized, this function shall simply return without any further elaboration. */

/** !req SWS_Adc_00480 void IoHwAb_Adc_NotifyReadyForPowerState<Mode>( void ) */
/** !req SWS_Adc_00451 The ADC module configuration shall be such that an ADC Channel group contains exactly one ADC Channel if the global limit checking feature is enabled and the channel specific limit checking is enabled for the ADC Channel. */
/** !req SWS_Adc_00516 Adc_GroupPriorityType */


