Anyc-Qing/AUTOSAR/core/mcal/Adc/src/Adc_Hw_tms570.c
/* ----------------------------[HW Specific Functions]---------*/
/* @brief Hardware specific implementation of Adc_Init
 * @param[in] ConfigPtr - ConfigPtr - Pointer to configuration set
 */
void Adc_Hw_Init(const Adc_ConfigType *ConfigPtr) {
    uint32 channels = 0;
	uint32 OPMODECR_reg_val = ADC_EN_10BIT;

	memset( &Adc_Global, 0, sizeof(Adc_Global));
	Adc_Global.config = ConfigPtr;

	/*Loop over the ADC controllers, this loop setup ASR specified Adc group status, current sample number*/
	for (uint32 configId = 0; configId < ADC_ARC_CTRL_CONFIG_CNT; configId++) {


        const Adc_ConfigType *AdcConfigPtr = Adc_Hw_GetConfigPTR(configId);
        for (Adc_GroupType group = 0; group < AdcConfigPtr->nbrOfGroups; group++) {
            /** @req SWS_Adc_00307 The function Adc_Init shall set all groups to ADC_IDLE state.*/
            AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;
            AdcConfigPtr->groupConfigPtr[group].status->currSampleCount = 0u;
            /** @req SWS_Adc_00077 The function Adc_Init shall disable the notifications and hardware trigger capability (if statically configured as active).*/
        #if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
            AdcConfigPtr->groupConfigPtr[group].status->notifictionEnable = 0;
        #endif
        }
	}

	/*
     * We have up to 2 controllers with 2 "normal" groups that
     * we need to initialize.
     *
     * Create the channels masks needed by HW
     * IMPROVEMENT: We should generate the mask
     */

    /* Loop over all controllers */
    for (uint32 configId = 0; configId < ADC_ARC_CTRL_CONFIG_CNT; configId++) {
    	/* @CODECOV:REDUNDANT_PARAMETER_VALIDATION: Already validated during code generation */
    	if(Adc_Hw_GetConfigPTR(configId) != NULL_PTR){

    		const Adc_ConfigType *AdcConfigPtr = Adc_Hw_GetConfigPTR(configId);
            adcBASE_t *hwPtr = GET_HW_PTR(AdcConfigPtr->hwConfigPtr->hwUnitId);

            /* Release from Reset */
            hwPtr->RSTCR = RSTCR_RELEASE;

            /* Enable ADC and setup 10bit/12bit ADC(depends on the configuration), leave the rest of the values as reset */
            if(AdcConfigPtr->hwConfigPtr->adcResolution == 12){
            	OPMODECR_reg_val = ADC_EN_12BIT;
            }

            hwPtr->OPMODECR = OPMODECR_reg_val;

            /* Setup prescaler */
            hwPtr->CLOCKCR = AdcConfigPtr->hwConfigPtr->adcPrescale - 1uL;

            /* Loop over the groups */
            for (Adc_GroupType group = 0; group < AdcConfigPtr->nbrOfGroups; group++) {
            	const Adc_GroupDefType *groupPtr = &(AdcConfigPtr->groupConfigPtr[group]);
                /* Loop over the channels */
                for (uint32 i = 0u; i < (uint32) groupPtr->numberOfChannels; i++) {
                    /* Select physical channel. */
                    channels |= (1uL << (uint32) groupPtr->channelList[i]);
                }

                /* Assign the channels to the group */
                ChannelMask[AdcConfigPtr->hwConfigPtr->hwUnitId][group] = channels;
                channels = 0;

                /* Setup Sample time */
                hwPtr->GxSAMP[group + 1] = groupPtr->arcAdcGroupSampTime & GxSAMP_ACQ_MASK;
            }
        }
    }

    /* Install all handlers */
#if !defined(CFG_DRIVERS_USE_CONFIG_ISRS)
    ISR_INSTALL_ISR2("ADC1Grp1ConvComplete", ADC1Grp1ConversionComplete_Isr, MIBADC1_GROUP_1, ADC_ISR_PRIORITY, 0);
    ISR_INSTALL_ISR2("ADC1Grp2ConvComplete", ADC1Grp2ConversionComplete_Isr, MIBADC1_GROUP_2, ADC_ISR_PRIORITY, 0);
    ISR_INSTALL_ISR2("ADC2Grp1ConvComplete", ADC2Grp1ConversionComplete_Isr, MIBADC2_GROUP_1, ADC_ISR_PRIORITY, 0);
    ISR_INSTALL_ISR2("ADC2Grp2ConvComplete", ADC2Grp2ConversionComplete_Isr, MIBADC2_GROUP_2, ADC_ISR_PRIORITY, 0);
#endif
    adcState = ADC_STATE_INIT;
}


#if (ADC_DEINIT_API == STD_ON)
/* @brief Hardware specific implementation of Adc_DeInit
 */
void Adc_Hw_DeInit (void) {
    /** @req SWS_Adc_00111 The function Adc_DeInit shall disable all used interrupts and notifications.*/
    /* Set AD Reset Control Register(ADRSTCR) to reset all ADC internal state
     * machines and control and status registers */
	/*lint -e{923} MISRA:PERFORMANCE:cast from unsigned int to pointer:[MISRA 2012 Rule 11.1, required]*/
	adcREG1->RSTCR = 0x1uL;
	/*lint -e{923} MISRA:PERFORMANCE:cast from unsigned int to pointer:[MISRA 2012 Rule 11.1, required]*/
	adcREG2->RSTCR = 0x1uL;
    adcState = ADC_STATE_UNINIT;
}
#endif


#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
/* @brief Hardware specific implementation of Adc_StartGroupConversion
 * @param[in] Group - Numeric ID of requested ADC channel group.
 */
void Adc_Hw_StartGroupConversion (Adc_GroupType Group){
    uint32 hwId = Group / ADC_NOF_GROUP_PER_CONTROLLER;
    uint32 groupIdx = Group % ADC_NOF_GROUP_PER_CONTROLLER;

    /* Generate interrupt at end of conversion  */
    GET_HW_PTR(hwId)->GxINTENA[groupIdx + 1] = ADC_GROUP_CONVERSION_END_ENABLE;
    GET_HW_PTR(hwId)->GxTHRINTCR[groupIdx+1] = 1; /* One conversion */

    /* Write to GxSEL to start the conversion */
    GET_HW_PTR(hwId)->GxSEL[groupIdx+1] = ChannelMask[hwId][groupIdx];
}


/* @brief Hardware specific implementation of Adc_StopGroupConversion
 * @param[in] Group - Numeric ID of requested ADC channel group.
 */
void Adc_Hw_StopGroupConversion (Adc_GroupType Group){
    uint32 hwId = Group / ADC_NOF_GROUP_PER_CONTROLLER;
    uint32 groupIdx = Group % ADC_NOF_GROUP_PER_CONTROLLER;

    /* disable interrupt for group   */
    GET_HW_PTR(hwId)->GxINTENA[groupIdx + 1] &= ~ADC_GROUP_CONVERSION_END_ENABLE;
    GET_HW_PTR(hwId)->GxTHRINTCR[groupIdx+1] = 0; /* No conversion */

    /** @req SWS_Adc_00385 When the ADC Channel Group is in one-shot and software-trigger mode, the function Adc_StopGroupConversion shall stop an ongoing conversion of the group.*/
    /** @req SWS_Adc_00386 When the ADC Channel Group is in continuous-conversion and software-trigger mode, the function Adc_StopGroupConversion shall stop an ongoing conversion of the group.*/

    /* Write to GxSEL to stop the conversion */
    GET_HW_PTR(hwId)->GxSEL[groupIdx+1] = 0;
}
#endif

/* @brief Returns the Adc_ConfigType pointer which points to a channel specified by the channel number
 * @param[in] AdcCtrlNum - Numeric ID of an ADC controller.
 * @return Adc_ConfigType pointer
 * @retval Configuration pointer points to a specific channel.
 */
const Adc_ConfigType* Adc_Hw_GetConfigPTR(uint32 AdcCtrlNum){
	return &Adc_Global.config[AdcCtrlNum];
}


/* @brief Returns the state of the Adc module.
 * @return Adc_StateType
 * @retval ADC_STATE_UNINIT	Adc module is not initialized
 * @retval ADC_STATE_INIT		Adc module is initialized
 */
Adc_StateType Adc_Hw_GetAdcState(void){
	return adcState;
}


/* @brief Returns the global pointer which points to the Adc configuration set.
 * @return Adc_GlobalType pointer
 * @retval Pointer points to the configuration set.
 */
Adc_GlobalType* Adc_Hw_GetGlobalTypeAddr(void){
	return &Adc_Global;
}


/* @brief Interrupt handler for processing ADC conversion interrupts, e.g. group conversion is completed, results have to be read from result register.
 * @param[in] Adc - ADC hardware unit ID, for TMS570, it can be 0 or 1(TMS570 microcontroller has two instances of ADC module).
 * @param[in] Group - Numeric ID of requested ADC channel group.
 */
void Adc_Hw_ADCConversionComplete_Isr(uint32 Adc, Adc_GroupType Group) {			// Parameters: HW ADC unit index, HW ADC group index
    uint32 data;
    adcBASE_t *hwPtr = GET_HW_PTR(Adc);
    uint32 dataMask = GxBUF_DATA10_MASK;		// default 10 bit resolution
    uint32 hwGroup = Group + 1;
    /* Get group, -1 is since hwGroup is TMS570 group that starts at 1...index starts at 0 */
    const Adc_GroupDefType * groupPtr = &(Adc_Hw_GetConfigPTR(Adc)->groupConfigPtr[Group]);     // Only addresses the ASR group0(in configuration, the name starts from 1, but array index starts from 0) and ASR group1

    /* Configuration is sorted according to HwUnit, and this is also the configuration */
    ASSERT( Adc_Hw_GetConfigPTR(Adc)->hwConfigPtr->hwUnitId == Adc );

    if(Adc_Hw_GetConfigPTR(Adc)->hwConfigPtr->adcResolution == 12) {     // 12-bit resolution
        dataMask = GxBUF_DATA12_MASK;
    }

