Anyc-Qing/AUTOSAR/core/mcal/Adc/src/Adc_Hw_tms570.c
    /* Copy the complete group to it's result registers */
    for (uint32 i = 0; i < (uint32) groupPtr->numberOfChannels; i++) {
        /* Read from FIFO */
        data = hwPtr->GxBUF[hwGroup].BUF0;				// Only maps ASR group0 to HW group1, ASR group1 to HW group2

        /* Mask away not needed things and put in result buffer */
        /** @req SWS_Adc_00122 If applicable, the function Adc_ReadGroup shall mask out all information or diagnostic bits provided by the conversion but not belonging to the conversion results themselves. */
        groupPtr->status->currResultBufPtr[i * groupPtr->streamNumSamples] = ((uint16) data & dataMask);
    }

    /* Clear interrupts */
    hwPtr->GxINTFLG[hwGroup] = (EV_END_MASK | EV_THR_INT_FLG_MASK);

    Adc_Hw_Isr(groupPtr);			// Only addresses ASR group0 and group1
}


/** @brief Based on the configuration of group, e.g. conversion mode and access mode, this function handles mainly the result buffer pointer.
 *  @param[in] GroupPtr - Pointer points to a certain requested channel group.
 */
void Adc_Hw_Isr(const Adc_GroupDefType * GroupPtr) {
	volatile uint32 *ADGxSEL_addr = NULL_PTR;

	/* @CODECOV:REDUNDANT_PARAMETER_VALIDATION: Already validated during code generation */
    if (GroupPtr != NULL_PTR) {

    	if (ADC_ACCESS_MODE_SINGLE == GroupPtr->accessMode) {		// single access mode
            /*
             * ADC_ACCESS_MODE_SINGLE access mode
             */
            GroupPtr->status->currSampleCount = 1;
            /** @req SWS_Adc_00325 The function Adc_GetGroupStatus shall return ADC_STREAM_COMPLETED*/
            GroupPtr->status->groupStatus = ADC_STREAM_COMPLETED;
#if(ADC_HW_TRIGGER_API == STD_ON)
            if ((GroupPtr->conversionMode == ADC_CONV_MODE_CONTINUOUS) ||
            	((GroupPtr->conversionMode == ADC_CONV_MODE_ONESHOT) && (ADC_TRIGG_SRC_HW == GroupPtr->triggerSrc))) {
#else
            if (GroupPtr->conversionMode == ADC_CONV_MODE_CONTINUOUS ) {
#endif
                /* Write to GxSEL to start the conversion */
            	ADGxSEL_addr = &(GET_HW_PTR(GroupPtr->hwUnit)->GxSEL[(GroupPtr->groupId % ADC_NOF_GROUP_PER_CONTROLLER) + 1]);
                *ADGxSEL_addr = *ADGxSEL_addr;				// reference: TMS570 reference manual P998

            }
        }
        else {	/*
        		 * ADC_ACCESS_MODE_STREAMING access mode, when SW trigger, only occurs in continuous conversion
        		 */
            if (ADC_STREAM_BUFFER_LINEAR == GroupPtr->streamBufferMode) {
                GroupPtr->status->currSampleCount++;
                if (GroupPtr->status->currSampleCount < GroupPtr->streamNumSamples) {
                    GroupPtr->status->currResultBufPtr++;
                    /** @req SWS_Adc_00224 The function Adc_GetGroupStatus shall return ADC_COMPLETED*/
                    GroupPtr->status->groupStatus = ADC_COMPLETED;

                    /* Write to GxSEL to start the conversion */
                    ADGxSEL_addr = &(GET_HW_PTR(GroupPtr->hwUnit)->GxSEL[(GroupPtr->groupId % ADC_NOF_GROUP_PER_CONTROLLER) + 1]);
                    *ADGxSEL_addr = *ADGxSEL_addr;

                }
                else {
                    /* All samples completed */
                    /** @req SWS_Adc_00325 The function Adc_GetGroupStatus shall return ADC_STREAM_COMPLETED*/
                    GroupPtr->status->groupStatus = ADC_STREAM_COMPLETED;
                }

            }
            else{

                GroupPtr->status->currResultBufPtr++;

                /* Check for buffer wrapping */
                /*lint -e{946} MISRA:PERFORMANCE:Relational or subtract operator applied to pointers, working with pointer in a controlled way results more simplified and readable code:[MISRA 2012 Rule 18.2, required]*/
                /*lint -e{9016} MISRA:PERFORMANCE:pointer arithmetic other than array indexing used, working with pointer in a controlled way results more simplified and readable code:[MISRA 2012 Rule 18.4, advisory]*/
                if (GroupPtr->status->currResultBufPtr
                        >= (GroupPtr->status->resultBufferPtr + GroupPtr->streamNumSamples)) {
                    GroupPtr->status->currResultBufPtr = GroupPtr->status->resultBufferPtr;
                }

                GroupPtr->status->currSampleCount++;
                if (GroupPtr->status->currSampleCount < GroupPtr->streamNumSamples) {
                    /** @req SWS_Adc_00224 The function Adc_GetGroupStatus shall return ADC_COMPLETED*/
                    GroupPtr->status->groupStatus = ADC_COMPLETED;
                }
                else {
                    GroupPtr->status->currSampleCount = GroupPtr->streamNumSamples;
                    /* All samples completed */
                    /** @req SWS_Adc_00325 The function Adc_GetGroupStatus shall return ADC_STREAM_COMPLETED*/
                    GroupPtr->status->groupStatus = ADC_STREAM_COMPLETED;
                }

                /* Turn on the end of stream/conversion interrupt again */
                /* Write to GxSEL to start the conversion */
                ADGxSEL_addr = &(GET_HW_PTR(GroupPtr->hwUnit)->GxSEL[(GroupPtr->groupId % ADC_NOF_GROUP_PER_CONTROLLER) + 1]);
                *ADGxSEL_addr = *ADGxSEL_addr;
            }
        }
        /* Call notification if enabled. */
        /** @req SWS_Adc_00082 void IoHwAb_AdcNotification<groupID>( void ) */
        /** @req SWS_Adc_00083 When the notification mechanism is disabled, the ADC module shall send no notification. */
        /** @req SWS_Adc_00416 When the notifications are re-enabled, the ADC module shall not send notifications for events that occurred while notifications have been disabled. */
        /** @req SWS_Adc_00060 The ADC module shall call the group notification function, whenever a conversion of all channels of the requested group is completed and if the notification is configured and enabled. */
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
        if ( (0u != GroupPtr->status->notifictionEnable))
        {
            GroupPtr->groupCallback();
        }
#endif
    }
}

/** @}*/
/** @}*/
